Тест_ЗУП_31_КОРП/src/Catalogs/ЭлектронныеТесты/ЭлектронныеТесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлектронныеТесты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.УдалитьТекстыЭлектронныхКурсов</types>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияЭлементовЭлектронногоКурса</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияЭлектронныхТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераТестовЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеЭлектронногоТеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииСтраницЭлектронногоКурса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ЭлектронныеРесурсы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>НачалоДиапазонаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазонаПопыток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаПопыток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрисоединенныйЭлемент</name>
      <type>
        <types>CatalogRef.ЭлектронныеРесурсы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/НазначенияЭлектронныхТестов/НазначенияЭлектронныхТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияЭлектронныхТестов</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ТестовыеВопросы/ТестовыеВопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТестовыеВопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Задание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаРезультата</name>
    <type>
      <types>EnumRef.МетодыРасчетаРезультатаТестовогоВопроса</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВарианты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасетныйВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
      <types>CatalogRef.ЭлементыЭлектронныхРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенРазвернутыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьИменаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКатегорий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВариантовОтветов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаПодсказку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальноеРазмещениеВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВариантов</name>
    <type>
      <types>EnumRef.ОтображениеВариантовТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйВыводВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.УчебныеПрограммныеПродукты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьКомментарииКВариантамОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВариантыРаботыСПрограммойЭлектронногоОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполняетсяПрограммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выделить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ЭлектронныеРесурсы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ЭлектронныеТесты/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции	

Функция ВопросыТеста(Тест)	Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраницыТеста.СсылкаНаЭлементКурса КАК Ссылка,
		|	ВЫРАЗИТЬ(СтраницыТеста.СсылкаНаЭлементКурса КАК Справочник.ТестовыеВопросы).ТипВопроса КАК ТипВопроса
		|ИЗ
		|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыТеста
		|ГДЕ
		|	СтраницыТеста.Владелец = &Тест
		|	И СтраницыТеста.ЭтоГруппа = ЛОЖЬ
		|	И СтраницыТеста.ПометкаУдаления = ЛОЖЬ
		|	И ТИПЗНАЧЕНИЯ(СтраницыТеста.СсылкаНаЭлементКурса) = ТИП(Справочник.ТестовыеВопросы)
		|	И СтраницыТеста.СсылкаНаЭлементКурса.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтраницыТеста.Родитель,
		|	СтраницыТеста.Код";
	
	Запрос.УстановитьПараметр("Тест", Тест);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

	
//////////////////////////////////////////////////////////////////////////////		
//////////////////////////////////////////////////////////////////////////////	
// СТАРОЕ	
	
#Область СлужебныеПроцедурыИФункции	

// Устанавливает обязательные реквизиты для заданных условий.
// Вызывается в обработчике события ПередЗаписью и в форме элемента справочника.
//
// Параметры
//  Объект - объект для заполнения свойствами.
//
Процедура УстановитьОбязательныеРеквизиты(Объект) Экспорт
	
	Если НЕ Объект.ПоказыватьНавигацию Тогда
		Объект.ПереходитьВпередАвтоматически = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НазначениеТестирования) Тогда
		Объект.НазначениеТестирования = Перечисления.НазначенияЭлектронныхТестов.Аттестация;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
